# Справка пользователя

## Название и версия

**C Subset Translator 1.0**

## Назначение

Программа предназначена для интерпретации упрощенного подмножества языка C. Проект подходит для демонстрации принципов построения трансляторов: лексического анализа, синтаксического анализа и выполнения программы на основе построенного синтаксического дерева.

## Установка

1. Установить Python 3.12 или новее.
2. Установить Java 8 или новее.
3. Установить зависимости:

```powershell
py -m pip install -r requirements.txt
```

4. Сгенерировать парсер ANTLR:

```powershell
powershell -ExecutionPolicy Bypass -File .\scripts\generate_parser.ps1
```

## Запуск

```powershell
py -3 src\main.py .\examples\demo.csub
```

При некорректном запуске программа выводит краткую справку:

```powershell
py -3 src\main.py --help
```

## Формат входной информации

Поддерживается следующее подмножество C:

- объявления переменных: `int x = 5;`, `bool flag = true;`, `char* name = "John";`
- присваивание: `x = x + 1;`
- типы данных: `int`, `bool`, `char*`, `struct Name`
- арифметика: `+`, `-`, `*`, `/`, `%`
- сравнения: `==`, `!=`, `<`, `>`, `<=`, `>=`
- логические операции: `&&`, `||`, `!`
- условия: `if (x > 5) { ... } else { ... }`
- циклы: `while (x < 10) { ... }`
- вывод на экран: `printf("%d\n", x);`
- функции: `int add(int a, int b) { return a + b; }`
- структуры:

```c
struct Point {
    int x;
    int y;
};

struct Point point;
point.x = 4;
point.y = 6;
printf("%d\n", point.x + point.y);
```

Ограничения текущей реализации:

- нет массивов;
- нет указателей, кроме `char*`;
- нет `for`, `do while`, `switch`;
- нет препроцессора `#include`, `#define`;
- нет `malloc` и `free`;
- нет вложенных функций;
- структуры передаются и присваиваются по значению.
